package com.example.plantfinder.data;

import java.util.HashMap;

import java.util.HashMap;

public class Description {
    // HashMap 초기화
    public static HashMap<String, String> plantDescriptions = new HashMap<String, String>() {{
        put("감나무", "평균 크기는 4m 정도이나 예외적으로 10m까지 크는 감나무도 보인다. 나무껍질은 흑회색으로 코르크화되어서 잘게 갈라지고 일년생가지에는 갈색털이 있다. 잎사귀는 어긋나기하며, 둥글넓적하고 두껍고 톱니가 없이 매끈매끈하며 가을에 주황색으로 단풍이 든다.");
        put("개나리", "우리나라 곳곳에 심겨진 개나리는 봄이 왔음을 알리는 봄의 전령사이자 봄철 따스한 햇빛으로 부터 피부를 보호하여 하얀 피부미인을 만들어 주는 나무이다.");
        put("금잔화", "국화과의 한해살이풀로 노란색 꽃이 특징적이다. 이름도 황금색 술잔을 닮았다고 하여 금잔화(金盞花). 꽃은 6~9월에 피고 열매는 8~10월에 익는다. 보통 화단에 관상용으로 기르며 약용하거나 식용색소로도 쓰인다. 원산지는 유럽 남부 지중해 연안이다.");
        put("나팔꽃", "가지목 메꽃과의 한해살이풀 또는 여러해살이풀[1][2]로서, 주변의 물체에 지지하여 자라는 덩굴식물이다. 기원지는 중앙아메리카다.");
        put("단풍나무", "봄이 되면 잎사귀와 함께 붉은 꽃봉오리를 가진 꽃이 피며, 꽃이 안개꽃보다 작아서 여러 꽃이 다발로 모여서 피어난다. 꽃말은 '사양', '은둔', '자제'.");
        put("달리아", "일반적으로 구근으로 번식시킨다. 품종에 따라 꽃의 형태, 크기, 화색이 매우 다양하여 인기가 많다. 보통 두상화의 지름이 5∼7.5cm정도로 피지만 대륜계인 경우 해바라기 못지않은 큰 키에 크고 아름다운 꽃을 피운다.");
        put("대나무", "국명에 '나무'라는 낱말이 들어가서 나무(목본식물)로 착각하기 쉽지만, 실제로는 나무가 아니라 풀(초본식물)에 속한다. 식물학적으로 나무로 분류되려면 두 가지 조건을 만족해야 한다.");
        put("데이지", "뿌리는 수염뿌리로 사방으로 퍼져나가며, 잎은 줄기가 아닌 뿌리에서 나오고, 달걀처럼 둥그스름한 타원형이다. 꽃은 봄부터 가을까지 오랫동안 피며, 종에 따라 흰색, 연한 홍색, 홍색 또는 홍자색으로 매우 다양하다.");
        put("라벤더", "지중해 원산의 꿀풀과 라벤더속의 상록 관목. 허브를 대표하는 식물 중 하나이다. 기다란 꽃대 위에 보라색의 작고 기다란 타원형의 꽃망울들이 옹기종기 매달려서 마치 이삭과 같은 꼴을 이루고 있는 것이 특징이다");
        put("라일락", "높이는 4m까지 자라고, 잎은 마주나기하고 달걀 모양에 털이 없고 광택이 나며 가장자리에 톱니가 없다. 꽃은 매년 4~5월에 걸쳐 피며 중부지방에서는 5월 중순에 개화한다.");
        put("로즈마리", "꿀풀목 꿀풀과에 속하는 다년생 상록관목. 잎은 침엽수처럼 좁고 뾰족하며 꽃은 작은 편이다.");
        put("매화", "장미과 벚나무속으로 매화(梅花)라는 꽃을 피우고 매실이라는 열매를 맺는 낙엽활엽수이다. 흔히 '매화' 또는 '매화나무'라고 부르나 국가표준식물목록의 정식명칭은 '매실나무'이다.");
        put("모과", "원산지는 중국이며, 한국과 일본에서도 자란다. 한반도에 전래된 정확한 시기는 알려지지 않았지만, 아무래도 조선시대 이전으로 추정된다. 주 재배지는 전라남도, 충청남도, 경기도 일대. 장미과의 낙엽성 활엽 과목.");
        put("목련", "목련(木蓮, Mokryeon)은 한국(제주도)과 일본에 자생하는 Magnolia kobus를 가리킨다. 흔히 국내에서는 중국 원산의 백목련(Magnolia denudata)을 '목련'이라고 부르는데, 엄밀히 말하면 둘은 같은 속 다른 종이다.");
        put("무궁화", "꽃은 제법 큰 편이며,[2] 꽃잎은 흰색 내지는 분홍색을 띄며 5장이 잔처럼 벌어진다. 가운데 붉은 테(일명 '단심')가 있고 거기서 노란 수술이 솟아있는 것이 특징이다.");
        put("민들레", "민들레는 국화과에 속하는 다년생 초본식물로서, 우리나라 각지의 밭이나 공터의 양지바른 곳에서 자라는 여러해살이풀이다.");
        put("바질", "꿀풀과에 속한 한해살이풀이자 향신료의 일종이다. 이탈리아 요리[3], 중국 요리에 주로 사용된다. 중국이나 대만에서는 라륵(羅勒) 또는 속어로 지우칭타(구층탑 九層塔)이라고도 부르며, 고대에 훈(薰)이라 불렸던 풀이 이것으로 추정된다. 태국 요리에도 종류에 따라 호라파(Horapha; โหระพา)와 카파오(Khaphrao; กะเพรา)라는 이름으로 많이 쓰인다.");
        put("백합", "백합목 백합과에 속하는 관속식물이다. 일본 원산이며 관상용으로 공원, 화단, 온실, 밭 등에 심어 기르는 여러해살이풀이다. 줄기는 높이는 30~100cm이다. 비늘줄기는 편평한 구형으로 지름 4~7cm, 연한 황색이다.");
        put("벚꽃", "대표적인 꽃말은 아름다운 정신(영혼), 정신적 사랑, 삶의 아름다움이다. 그 외에도 절세미인, 삶의 덧없음과 아름다움, 순결, 뛰어난 아름다움, 정신미, 교양, 부(富), 그리고 번영을 뜻하기도 한다.");
        put("복숭아", "복사나무의 열매로 사과, 배와 더불어서 대표적인 인기 과일이다. 원산지는 중국이며, 특히 베이징시 근처에서 많이 난다. 삼국지연의에서의 그 유명한 도원결의가 일어난 장소도 오늘날 베이징 일대인 탁군(涿郡)이다. 강수량이 적고 일조량이 많은지라 품질 좋고 많은 복숭아를 생산하기에 아주 적합한 기후라서 그런 듯하다.");
        put("사과", "일반적으로 한국에서 말하는 사과 맛은 달콤새콤 + 아삭아삭하게 씹히는 탄력이 있고 단단한 과육의 식감을 말한다. 종마다 다르지만 잘 익은 사과는 껍질이 벗겨지지 않은 상태에서도 청량감이 있는 좋은 냄새가 난다.");
        put("솔방울", "소나무 열매의 송이. 씨앗이 들어있는 자그마한 비늘들이 둥글게 모인 형태이다. 소나무가 아니더라도 침엽수의 열매들 중 비슷하게 생긴 것들을 통틀어 솔방울이라고 부르기도 하며, 잣을 비롯한 일부 종은 먹을 수도 있다.");
        put("수국", "수국은 수국과 수국속에 속하는 갈잎떨기나무이며, 초여름에서 무더운 여름 중순까지 꽃이 핀다. 좁은 의미로 쓰일 때는 Hydrangea macrophylla만을 가리키나, 보통은 수국속에 속하는 모든 종을 가리키는 말이다.");
        put("수선화", "포는 막질이며 꽃봉오리를 감싸고 꽃자루 끝에 5∼6개의 꽃이 옆을 향하여 핀다. 화피갈래조각은 6개고 흰색 혹은 노란색이며, 부화관은 높이 4mm 정도로 노란색이다. 6개의 수술은 부화관 밑에 달리고, 암술은 열매를 맺지 못하며 비늘줄기로 번식한다. 추위를 잘 견디며, 수선화의 생즙을 갈아 부스럼 치료에 사용할 수 있다");
        put("안개꽃", "멀리서 보면 눈이 내려앉은 것 같아보이고 가까이서 보아도 꽤 이쁘다. 따라서 관상용, 선물용으로 많이 쓰이며 꽃꽂이에서도 자주 쓰인다. 꽃꽂이에서는 주로 아랫부분을 풍성하게 하여 전체적인 밸런스를 잡는 용도로 많이 쓰인다.");
        put("알로에", "특이하게 잎자루가 없이 줄기에서 속이 투명한 젤로 가득한 두꺼운 잎이 어긋나 자라나는 형태다. 대다수의 종이 줄기가 없거나 짧지만, 나무처럼 자라거나 줄기 단 하나만 자라거나 관목처럼 자라거나 덩굴이 지거나 땅에 기는 종류, 심지어 초본류까지 엄청나게 다양하다");
        put("연꽃", "인도가 원산지인 꽃. 보통 연꽃이라고 하면 연못 위에 둥둥 떠 있는 수생식물이라는 이미지만 떠올리기 쉽지만 실은 논이나 늪지의 진흙 속에서도 자란다. 관상용뿐만 아니라 식용, 약용으로 쓰이기도 해서 연의 줄기(연근)는 한국에서는 먹거리로 자주 이용된다. 이런 까닭으로 가끔 여름철 농촌에 가면 벼 대신에 연꽃을 대량으로 재배하는 곳을 발견할 수 있다. 꽃이 아름답고 향도 있어서 연꽃축제도 심심찮게 열린다.");
        put("은행나무", "은행(銀杏)은 동아시아 원산의 나무로, 암수딴그루이다. 가을이 되면 낙엽이 지기 전에 잎사귀가 샛노랗게 물들어 아름답고, 병해충에 강한 특징 등 다른 여러 장점이 있어 가로수로 많이 심는다.");
        put("장미", "장미과 장미속의 관목을 통틀어 이르는 말이다. 높이는 2~3m이며 잎은 어긋나고 깃 모양으로, 5~6월에 담홍색, 담자색, 흰색 등의 꽃이 피고는 한다. 개량 품종이 많은 관상 꽃나무이다. 북반구의 온대와 아한대에 주로 분포한다. 장미는 광을 매우 좋아하는 식물이며 배수가 좋고 공기유통이 비옥한 사양토에서 잘 자란다.");
        put("제비꽃", "들에서 흔히 자란다. 높이 10cm 내외이다. 기사. 원줄기가 없고 뿌리에서 긴 자루가 있는 잎이 자라서 옆으로 비스듬히 퍼진다. 잎은 긴 타원형 바소꼴 이며 끝이 둔하고 가장자리에 둔한 톱니가 있다. 꽃이 진 다음 잎은 넓은 삼각형 바소꼴로 되고 잎자루의 윗부분에 날개가 자란다.");
        put("진달래", "진달래는 진달래과 진달래속에 속하는 낙엽활엽 관목으로, 한반도에 주로 분포하며, 일본[1]과 만주, 중국 대륙 동부, 몽골, 연해주 일대[2]에서도 볼 수 있다. 두견화, 참꽃 등으로도 불리며, 함경북도에서는 천지꽃이라고 한다. 나물의 한 종류인 달래와는 완전히 무관한 식물이다.");
        put("카네이션", "석죽목 석죽과 패랭이꽃속에 속하는 여러해살이풀. 지중해 원산으로 추측되지만 예전부터 세계 곳곳에서 길러서 정확히는 알 수 없다. 80cm 남짓한 키에 잎이 5개인 꽃이 핀다. 원래 꽃의 색깔은 연분홍색 띤 자주색이지만 현재는 흰색, 녹색 등으로 다양하게 개발되었다.");
        put("코스모스", "코스모스는 국화과의 한해살이풀로, 원산지는 멕시코이다. 이름의 유래는 질서를 뜻하는 코스모스.");
    }};
}